---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CoverTypeLength
source: html/69bf97c1-aa53-5448-69a7-3fc13c4910ef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CoverTypeLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId CoverTypeLength { get; }
```